src/user.org
#+TITLE: Non-root user workflows
#+LANGUAGE: en
#+PROPERTY: header-args:python :tangle lib/user.py
#+PROPERTY: header-args:bash   :tangle no :dir (expand-file-name ".." default-directory) :results verbatim :cache yes

Running containers as root is a security risk. I need reusable helpers
to create users, switch to them, and set up their environment — without
repeating the same =adduser= boilerplate in every project.

#+begin_src python
import shlex

import dagger
from dagger import function
#+end_src

* Creating a user with groups and sudo

  I need to create a user with a specific UID, optional group memberships,
  and optional passwordless sudo access. This covers both development
  containers (where sudo is handy) and production ones (where it's not).

  The username defaults to =Lib.default_username= so it's defined once
  and overridable globally — pass =None= (the default) and the
  library-level setting applies.

  [[https://docs.dagger.io/api/reference#definition-Container][.with_env_variable]] sets an environment variable inside the
  container, like =ENV= in a Dockerfile. We use it here to set =HOME=
  and later to prepend =~/.local/bin= to =PATH= (with =expand=True= so
  =$PATH= is resolved at build time).

  #+begin_src python
  @function
  def setup_user(
      self,
      ctr: dagger.Container,
      uid: int = 1000,
      username: str | None = None,
      sudoer: bool = False,
      shell: str = "/bin/sh",
      groups: list[str] = (),
  ) -> dagger.Container:
      """Create a user with optional groups and sudo access."""
      username = username or self.default_username
      q_username = shlex.quote(username)
      q_shell = shlex.quote(shell)
      ctr = (
          ctr
          .with_env_variable("HOME", f"/home/{username}")
          .with_exec([
              "sh", "-c",
              "command -v adduser > /dev/null"
              " || { command -v apt > /dev/null"
              " && apt update && apt install --yes adduser ; }",
          ])
          .with_exec([
              "sh", "-c",
              f"addgroup --gid {uid} --system {q_username}"
              f" && adduser --uid {uid} --shell {q_shell}"
              f" --disabled-password --gecos '' {q_username}"
              f" --ingroup {q_username}"
              f" && chown -R {q_username}:{q_username} /home/{q_username}",
          ])
      )
      if sudoer:
          ctr = ctr.with_exec([
              "sh", "-c",
              f'mkdir -p /etc/sudoers.d'
              f' && echo "{q_username} ALL=(ALL) NOPASSWD: ALL"'
              f' >> /etc/sudoers.d/username',
          ])
      if groups:
          groups_str = " ".join(shlex.quote(g) for g in groups)
          ctr = ctr.with_exec([
              "sh", "-c",
              f"for group in {groups_str} ; do"
              f' {{ grep -q -E "^${{group}}:" /etc/group'
              f" || addgroup --system $group ; }}"
              f" && adduser {q_username} $group ; done",
          ])
      ctr = ctr.with_env_variable(
          "PATH", f"/home/{username}/.local/bin:$PATH", expand=True,
      )
      return ctr
  #+end_src

* Switching to a user

  Once a user is created, I want to switch to it and land in their home
  directory — just like logging in.

  [[https://docs.dagger.io/api/reference#definition-Container][.with_user]] switches the active user for all subsequent commands,
  like =USER= in a Dockerfile. Combined with [[https://docs.dagger.io/api/reference#definition-Container][.with_workdir]] it
  simulates a login into the user's home directory.

  #+begin_src python
  @function
  def as_user(
      self,
      ctr: dagger.Container,
      uid: int = 1000,
      username: str | None = None,
  ) -> dagger.Container:
      """Switch to user and set workdir to their home."""
      username = username or self.default_username
      return (
          ctr
          .with_env_variable("HOME", f"/home/{username}")
          .with_user(username)
          .with_workdir(f"/home/{username}")
      )
  #+end_src

* The full combo: create + switch

  Most of the time I just want "give me a user and switch to it". This
  combines [[*Creating a user with groups and sudo][setup_user]] and [[*Switching to a user][as_user]] in one call.

  #+begin_src python
  @function
  def use_user(
      self,
      ctr: dagger.Container,
      groups: list[str] = (),
      uid: int = 1000,
      sudoer: bool = False,
      username: str | None = None,
  ) -> dagger.Container:
      """Create a user and switch to it (SETUP_USER + AS_USER)."""
      ctr = self.setup_user(ctr, uid=uid, username=username, sudoer=sudoer, groups=groups)
      ctr = self.as_user(ctr, uid=uid, username=username)
      return ctr
  #+end_src

  We test user creation via the [[file:alpine.org::*A non-root user for safer workflows][alpine-user]] target (which calls [[*The full combo: create + switch][use_user]]):

  #+NAME: use_user_whoami
  #+begin_src fixtureyaml
func: alpine-user
chain:
  - with-exec: [whoami]
  - stdout
  #+end_src

  #+RESULTS[84729e04121e22cfb1858e425b78310ab46feb48]: use_user_whoami
  :results:
  #+begin_src bash :exports code :eval no-export
  dagger call alpine-user with-exec --args="whoami" stdout
  #+end_src

  #+RESULTS[598314540270cb528c156af82b8c46b52e84879f]:
  : sam
  :end:

  #+NAME: use_user_workdir
  #+begin_src fixtureyaml
func: alpine-user
chain:
  - with-exec: [pwd]
  - stdout
  #+end_src

  #+RESULTS[42b210ef97245f0d08c57b8c79d3fccbfc73bbb7]: use_user_workdir
  :results:
  #+begin_src bash :exports code :eval no-export
  dagger call alpine-user with-exec --args="pwd" stdout
  #+end_src

  #+RESULTS[eb99389b500365541b1090dbc071bf550d4dbba6]:
  : /home/sam
  :end:
